{
  "react": {
    "slug": "react",
    "title": "React",
    "tutorials": [
      {
        "slug": "getting-started",
        "title": "Getting started",
        "technology": "react",
        "pages": [
          {
            "slug": "welcome",
            "title": "Welcome to Liveblocks",
            "description": "Learn how to build realtime collaborative applications using React, Next.js, TypeScript, and Liveblocks. Liveblocks is a realtime collaboration infrastructure for building performant collaborative experiences."
          },
          {
            "slug": "connecting",
            "title": "Connecting to Liveblocks",
            "description": "Learn how to create a Liveblocks realtime client, and then connect to it with the JavaScript createClient function."
          },
          {
            "slug": "joining-a-room",
            "title": "Joining a room",
            "description": "Learn how to join a Liveblocks room in your React collaborative application, using the RoomProvider component."
          },
          {
            "slug": "others",
            "title": "Displaying others",
            "description": "Learn how to use Liveblocks others to display online presence in your collaborative React application with useOthers."
          },
          {
            "slug": "presence",
            "title": "Using presence",
            "description": "Learn how to set up and use the current user’s Liveblocks Presence values in your collaborative React application with useMyPresence."
          },
          {
            "slug": "updating-presence",
            "title": "Updating presence",
            "description": "Learn how to update the current user’s Liveblocks Presence values in your multiplayer React application with updateMyPresence."
          },
          {
            "slug": "live-cursors",
            "title": "Live cursors using presence",
            "description": "Learn how to build realtime cursors with Liveblocks Presence values in your collaborative React application with useOthers."
          },
          {
            "slug": "broadcasting-events",
            "title": "Broadcasting events",
            "description": "Learn how to broadcast realtime toast notification events using Liveblocks and useBroadcastEvent in your React application."
          },
          {
            "slug": "storage",
            "title": "Storage",
            "description": "Learn how to create realtime document storage in React with Liveblocks’ conflict-free data types and the useStorage hook."
          },
          {
            "slug": "modifying-storage-data",
            "title": "Modifying storage data",
            "description": "Learn how to modify realtime conflict-free data storage with the Liveblocks useMutation React hook."
          },
          {
            "slug": "nesting-data-types",
            "title": "Nesting data types",
            "description": "Learn how to nest Liveblocks realtime conflict-free data types within each other, enabling more complex React applications."
          }
        ]
      }
    ]
  }
}
